# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [10]:
# assume range is inclusive and number is an integer. ie random number from 1 to 4 means random number chosen from [1, 2, 3, 4]
first_series = pd.Series(np.random.randint(1, 5, 100))
second_series = pd.Series(np.random.randint(1, 4, 100))
third_series = pd.Series(np.random.randint(10_000, 30_001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [13]:
df = pd.concat([first_series, second_series, third_series], axis=1)
df

    0  1      2
0   2  2  11315
1   2  2  27235
2   2  1  20834
3   2  3  14202
4   2  2  17491
.. .. ..    ...
95  4  3  26649
96  1  3  29126
97  3  3  21309
98  2  2  18313
99  2  1  16814

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [17]:
df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       2       2            11315
1       2       2            27235
2       2       1            20834
3       2       3            14202
4       2       2            17491
..    ...     ...              ...
95      4       3            26649
96      1       3            29126
97      3       3            21309
98      2       2            18313
99      2       1            16814

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [30]:
bigcol_series = pd.concat([first_series, second_series, third_series])
bigcolumn = pd.DataFrame(bigcol_series)
bigcolumn

        0
0       2
1       2
2       2
3       2
4       2
..    ...
95  26649
96  29126
97  21309
98  18313
99  16814

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [20]:
# yes, it's true

pandas.core.series.Series

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [37]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        2
2        2
3        2
4        2
..     ...
295  26649
296  29126
297  21309
298  18313
299  16814

[300 rows x 1 columns]